<a href="https://colab.research.google.com/github/Asami1997/Applied-Data-Science-Specialization-The-University-of-Michigan/blob/master/Week2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
pd.Series?

In [0]:
animals = ['Owl','Fish','Camel']
pd.Series(animals)

0      Owl
1     Fish
2    Camel
dtype: object

In [0]:
numbers = [1,2,3]

In [0]:
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [0]:
x = ['random',None]

In [0]:
pd.Series(x)

0    random
1      None
dtype: object

In [0]:
y = [1,2,4,None]
pd.Series(y)

0    1.0
1    2.0
2    4.0
3    NaN
dtype: float64

In [0]:
import numpy as np
np.nan == np.nan

False

In [0]:
np.isnan(y)

array([False, False, False,  True])

In [0]:
info = {'email':'asami1997@gmail.com','name' : 'Ahmad'}

In [0]:
f = pd.Series(info)

In [0]:
f

email    asami1997@gmail.com
name                   Ahmad
dtype: object

In [0]:
f.index

Index(['email', 'name'], dtype='object')

Passing the index and values explicitly

In [0]:
d = pd.Series(['asamil997@gmail.com','ahmad'],index=['email','name'])

In [0]:
d

email    asamil997@gmail.com
name                   ahmad
dtype: object

Quering Series

In [0]:
sports = {'Football':'UK',
          'Cricket' : 'Pakistan'}

In [0]:
s = pd.Series(sports)

In [0]:
s.iloc[1]

'Pakistan'

In [0]:
s.loc['Football']

'UK'

In [0]:
import numpy as np

In [0]:
x = np.random.randint(0,100,1000)

In [0]:
x_series = pd.Series(x)

In [0]:
np.sum(x_series)

37

using the timeit cell maginc command

In [0]:
%%timeit -n 100
total = 0
for item in x_series:
  total+=item

100 loops, best of 3: 3.9 µs per loop

In [0]:
%%timeit -n 100
np.sum(x_series)

100 loops, best of 3: 87.5 µs per loop

Broadcasting

In [0]:
x_series += 2

In [0]:
x_series.head()

0     7
1    16
2    37
3    34
4    97
dtype: int64

94

In [0]:
x_series.size

1000

adding new values using loc ( index 1000 dose not exist)

In [0]:
x_series.loc[1000] = 7

Mixed types of indecies and labels.

In [0]:
z = pd.Series([9,'x'],index = [100,'Name'])

In [0]:
z

100     9
Name    x
dtype: object

DataFrame

Creaeting the dataframe as a group of series

In [0]:
purchase_1 = pd.Series({'Name':'Ahmad','Cost':20,'Item':'Keyboard'})
purchase_2 = pd.Series({'Name':'Sami','Cost':30,'Item':'Monitor'})
purchase_3 = pd.Series({'Name':'Hussein','Cost':40,'Item':'Chair'})

In [0]:
df = pd.DataFrame([purchase_1,purchase_2,purchase_3],index=['store1','store1','store3'])

In [0]:
df

           Name  Cost      Item
store1    Ahmad    20  Keyboard
store1     Sami    30   Monitor
store3  Hussein    40     Chair

In [0]:
df.loc['store1']

         Name  Cost      Item
store1  Ahmad    20  Keyboard
store1   Sami    30   Monitor

Get all items regardless of the store, the entire column

In [0]:
df['Item']

store1    Keyboard
store1     Monitor
store3       Chair
Name: Item, dtype: object

Get the cost of just store 1, row and column


1.   List item
2.   List item

In [0]:
df.loc['store1','Cost']

Chaining operations , not recomended

In [0]:
df.loc['store1']['Cost']

store1    20
store1    30
Name: Cost, dtype: int64

slciing , get all the rows and the columns we need

In [0]:
df.loc[:,['Name','Item']]

           Name      Item
store1    Ahmad  Keyboard
store1     Sami   Monitor
store3  Hussein     Chair

The Drop function, takes the rows index as parameter

In [0]:
df.drop('store1')

           Name  Cost   Item
store3  Hussein    40  Chair

In [0]:
df

           Name  Cost      Item
store1    Ahmad    20  Keyboard
store1     Sami    30   Monitor
store3  Hussein    40     Chair

In [0]:
copy_dataframe = df.copy()

In [0]:
copy_dataframe

           Name  Cost      Item
store1    Ahmad    20  Keyboard
store1     Sami    30   Monitor
store3  Hussein    40     Chair

making the change on the dataframe. , on the row

In [0]:
df.drop('store1',inplace=True,axis=0)

In [0]:
df

           Name  Cost   Item
store3  Hussein    40  Chair

In [0]:
df.drop('Item',inplace=True,axis = 1)

In [0]:
df

           Name  Cost
store3  Hussein    40

dropping directly using the del opertator.

In [0]:
del df['Cost']

In [0]:
df

           Name
store3  Hussein

Adding a new column , will broadcast the result accross all rows.

In [0]:
df['Location'] = None

In [0]:
df

           Name Location
store3  Hussein     None

In [0]:
z = {'Name':'Ahmad','Email':'asami1997@gmail.com'}

In [0]:
z_df

                         0
Name                 Ahmad
Email  asami1997@gmail.com

In [0]:
olympics = pd.read_csv('/content/drive/My Drive/olympics.csv')

In [0]:
olympics.head()

                   0         1     2     3  ...    12    13    14              15
0                NaN  № Summer  01 !  02 !  ...  01 !  02 !  03 !  Combined total
1  Afghanistan (AFG)        13     0     0  ...     0     0     2               2
2      Algeria (ALG)        12     5     2  ...     5     2     8              15
3    Argentina (ARG)        23    18    24  ...    18    24    28              70
4      Armenia (ARM)         5     1     2  ...     1     2     9              12

[5 rows x 16 columns]

specifying the first col to be the index label. skiprows = 0 means don't skip any rows

In [0]:
olympics = pd.read_csv('/content/drive/My Drive/olympics.csv',index_col=0,skiprows=1)

In [0]:
olympics.head()

                         № Summer  01 !  02 !  ...  02 !.2  03 !.2  Combined total
Afghanistan (AFG)              13     0     0  ...       0       2               2
Algeria (ALG)                  12     5     2  ...       2       8              15
Argentina (ARG)                23    18    24  ...      24      28              70
Armenia (ARM)                   5     1     2  ...       2       9              12
Australasia (ANZ) [ANZ]         2     3     4  ...       4       5              12

[5 rows x 15 columns]

In [0]:
olympics.columns

Index(['№ Summer', '01 !', '02 !', '03 !', 'Total', '№ Winter', '01 !.1',
       '02 !.1', '03 !.1', 'Total.1', '№ Games', '01 !.2', '02 !.2', '03 !.2',
       'Combined total'],
      dtype='object')

In [0]:
for col in olympics.columns:
  print(col)

№ Summer
01 !
02 !
03 !
Total
№ Winter
01 !.1
02 !.1
03 !.1
Total.1
№ Games
01 !.2
02 !.2
03 !.2
Combined total

changing the column names, structure :df.rename( columns = {columnindex : value you want to change})

In [0]:
for col in olympics.columns:
  if col[:2] == '01':
    olympics.rename(columns = {col:'Gold' + col[4:]},inplace = True)
  if col[:2] == '02':
    olympics.rename(columns = {col:'Silver'+  col[4:]},inplace = True)
  if col[:2] == '03':
    olympics.rename(columns = {col:'Bronze' +  col[4:]},inplace = True)
  if col[:1] == '№':
    olympics.rename(columns = {col:'#' + col[4:]},inplace = True)

In [0]:
olympics.head()

                         #mmer  Gold  ...  Bronze.2  Combined total
Afghanistan (AFG)           13     0  ...         2               2
Algeria (ALG)               12     5  ...         8              15
Argentina (ARG)             23    18  ...        28              70
Armenia (ARM)                5     1  ...         9              12
Australasia (ANZ) [ANZ]      2     3  ...         5              12

[5 rows x 15 columns]

Querying Dataframes

Get only the countries with atleast one gold medal in the summer. The where argument contains the boolean mask.

This retruns the enite row where gold is > 0

In [0]:
only_gold = olympics.where(olympics['Gold'] > 0)

In [0]:
only_gold

                                              #mmer  ...  Combined total
Afghanistan (AFG)                               NaN  ...             NaN
Algeria (ALG)                                  12.0  ...            15.0
Argentina (ARG)                                23.0  ...            70.0
Armenia (ARM)                                   5.0  ...            12.0
Australasia (ANZ) [ANZ]                         2.0  ...            12.0
...                                             ...  ...             ...
Independent Olympic Participants (IOP) [IOP]    NaN  ...             NaN
Zambia (ZAM) [ZAM]                              NaN  ...             NaN
Zimbabwe (ZIM) [ZIM]                           12.0  ...             8.0
Mixed team (ZZX) [ZZX]                          3.0  ...            17.0
Totals                                         27.0  ...         17579.0

[147 rows x 15 columns]

In [0]:
only_gold['Gold'].count()

100

In [0]:
olympics['Gold'].count()

147

We need to drop the Nan gold values

In [0]:
onlygold = only_gold.dropna()

In [0]:
onlygold

                           #mmer    Gold  ...  Bronze.2  Combined total
Algeria (ALG)               12.0     5.0  ...       8.0            15.0
Argentina (ARG)             23.0    18.0  ...      28.0            70.0
Armenia (ARM)                5.0     1.0  ...       9.0            12.0
Australasia (ANZ) [ANZ]      2.0     3.0  ...       5.0            12.0
Australia (AUS) [AUS] [Z]   25.0   139.0  ...     181.0           480.0
...                          ...     ...  ...       ...             ...
Venezuela (VEN)             17.0     2.0  ...       8.0            12.0
Yugoslavia (YUG) [YUG]      16.0    26.0  ...      29.0            87.0
Zimbabwe (ZIM) [ZIM]        12.0     3.0  ...       1.0             8.0
Mixed team (ZZX) [ZZX]       3.0     8.0  ...       4.0            17.0
Totals                      27.0  4809.0  ...    6078.0         17579.0

[100 rows x 15 columns]

The indexing Operator can take a boolean mask , Faster

In [0]:
olympics[olympics['Gold'] > 0]

                           #mmer  Gold  ...  Bronze.2  Combined total
Algeria (ALG)                 12     5  ...         8              15
Argentina (ARG)               23    18  ...        28              70
Armenia (ARM)                  5     1  ...         9              12
Australasia (ANZ) [ANZ]        2     3  ...         5              12
Australia (AUS) [AUS] [Z]     25   139  ...       181             480
...                          ...   ...  ...       ...             ...
Venezuela (VEN)               17     2  ...         8              12
Yugoslavia (YUG) [YUG]        16    26  ...        29              87
Zimbabwe (ZIM) [ZIM]          12     3  ...         1               8
Mixed team (ZZX) [ZZX]         3     8  ...         4              17
Totals                        27  4809  ...      6078           17579

[100 rows x 15 columns]

Combining boolean masks together

In [0]:
len(olympics[(olympics['Gold'] > 0) | (olympics['Gold.1'] > 0)])

101

Getting countries who won only won gold in the winter olympics and never in the summer using the indexing operator directly.

In [0]:
olympics[(olympics['Gold.1']>0) & (olympics['Gold'] == 0)]

                     #mmer  Gold  Silver  ...  Silver.2  Bronze.2  Combined total
Liechtenstein (LIE)     16     0       0  ...         2         5               9

[1 rows x 15 columns]

saving the current index

In [0]:
current_index = olympics.index

chaning the index, takes the column name as an argument

In [26]:
# adding the current index as a new column before overwriting
olympics['country'] = olympics.index
olympics.set_index('Gold')

      #mmer  ...                                       country
Gold         ...
0        13  ...                             Afghanistan (AFG)
5        12  ...                                 Algeria (ALG)
18       23  ...                               Argentina (ARG)
1         5  ...                                 Armenia (ARM)
3         2  ...                       Australasia (ANZ) [ANZ]
...     ...  ...                                           ...
0         1  ...  Independent Olympic Participants (IOP) [IOP]
0        12  ...                            Zambia (ZAM) [ZAM]
3        12  ...                          Zimbabwe (ZIM) [ZIM]
8         3  ...                        Mixed team (ZZX) [ZZX]
4809     27  ...                                        Totals

[147 rows x 15 columns]

promotes the index as a column and reset the original index

In [13]:
olympics.reset_index()

                                            index  ...  Combined total
0                               Afghanistan (AFG)  ...               2
1                                   Algeria (ALG)  ...              15
2                                 Argentina (ARG)  ...              70
3                                   Armenia (ARM)  ...              12
4                         Australasia (ANZ) [ANZ]  ...              12
..                                            ...  ...             ...
142  Independent Olympic Participants (IOP) [IOP]  ...               3
143                            Zambia (ZAM) [ZAM]  ...               2
144                          Zimbabwe (ZIM) [ZIM]  ...               8
145                        Mixed team (ZZX) [ZZX]  ...              17
146                                        Totals  ...           17579

[147 rows x 16 columns]

Hierarchical Indexing, if you added the drop paramater to the set index funciton it will conver the column to an index and keep them in the dataframe as well

In [18]:
olympics.set_index(['#mmer','Gold'])

            Silver  Bronze  Total  ...  Silver.2  Bronze.2  Combined total
#mmer Gold                         ...
13    0          0       2      2  ...         0         2               2
12    5          2       8     15  ...         2         8              15
23    18        24      28     70  ...        24        28              70
5     1          2       9     12  ...         2         9              12
2     3          4       5     12  ...         4         5              12
...            ...     ...    ...  ...       ...       ...             ...
1     0          1       2      3  ...         1         2               3
12    0          1       1      2  ...         1         1               2
      3          4       1      8  ...         4         1               8
3     8          5       4     17  ...         5         4              17
27    4809    4775    5130  14714  ...      5733      6078           17579

[147 rows x 13 columns]

When quering , you need to provide the index column names in order, if you want to query more than one thing , you need to put them in a list and each query in a tuple. each query should contain all the indcies, need to do multilevel indexing with strings. Below is an example

df.loc[[('Michigan','county 1'),('Michigan','county2'))

17